//#include<stdio.h>
//
//
////问题描述：输入N（N<=100）个数，每个数的范围> 0 并且 <= 100，
////请将每个不同的数按值出现的次数从小到大输出并且输出它对应的个数 【出现次数相同的仅输出最大的数】
//
////注：尽量将数组开在全局
//int fcount[101] = { 0 };//记录每个数出现的次数【注意声明一个数组要初始化大小】
//int scount[101] = { 0 };//索引是次数，值是数
//
//int main() {
//
//	int n;//输入的数的个数
//	int x; //记录当前输入的数
//
//	scanf_s("%d", &n);
//	//输入数+统计次数
//	for (int i = 0; i < n; i++) {
//		scanf_s("%d", &x);
//		fcount[x]++;
//	}
//	//按出现次数从小到大输出
//	for (int j = 0; j <= 100; j++) {
//		scount[fcount[j]] = j; //次数相同时大的值会覆盖小的值
//	}
//	for (int k = 1; k <= 100; k++) {
//		if(scount[k]>0){ //scount索引是出现次数，值是出现该次数的数值
//			//printf("%d %d", k,scount[k]);
//			printf("%d %d\n", scount[k],k); //一定要注意数组索引和值的具体含义；注意换行
//		}
//	}
//	
//	return 0;
//}

//总结：
//1.数组可以用于标记，如出现次数、地图
//2.格式化输出时一定要注意要求，该换行的时候换行，该输出空格的时候输出空格
//3.一定要注意数组索引和值的具体含义，不要弄反、弄混
//4.输出的起点要弄清楚，有的是从0开始，有的是从1开始


//
//using namespace std;


//
//int f[105] = { 0 };
//
//int p[105] = { 0 };//p[i]表示有i个这样的数的最大值是多少

//int main() {
//
//    int n, x;
//
//    scanf_s("%d", &n);
//
//    for (int i = 0; i < n; i++) {
//
//        scanf_s("%d", &x);
//
//        f[x]++;
//
//    }
//
//    for (int i = 0; i <= 100; i++) p[f[i]] = i;
//
//    for (int i = 1; i <= 100; i++) {
//
//        if (p[i] > 0) printf("%d %d\n", p[i], i);
//
//    }
//
//    return 0;
//
//}

